---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.NonContinuousRailInfo
source: html/e86f261b-8cd5-0a5f-f7db-00afb876923d.htm
---
# NonContinuousRailInfo Methods

Checks whether the input height is valid for a non-continuous rail in its associated railing type.